<template>
    <div>
        <div v-for="(item, index) in data" :key="index" class="version-history">
            <div class="version-history__header">
                <span class="version-history__date">{{ item.date }}</span>
                <span class="version-history__time">{{ item.time }}</span>
            </div>

            <div v-if="item.points.length" class="version-history__points">
                <p v-for="(point, pointIndex) in item.points" class="version-history__point">
                    {{ pointIndex + 1 }}. {{ point }}
                </p>
            </div>
        </div>
    </div>
</template>

<script lang="ts" setup>
    interface IVersion {
        date: string,
        time: string,
        points: string[];
    }

    const data: IVersion[] = [
        {
            date: '28.03.2023',
            time: '11:00',
            points: [
                'Исправил доли',
            ],
        },
        {
            date: '27.03.2023',
            time: '16:00',
            points: [
                'Добавил в расчет Авансовая оплата за товар без движения',
                'Добавил в расчет Частичная оплата брака',
            ],
        },
        {
            date: '20.03.2023',
            time: '15:00',
            points: [
                'Добавил в расчет Возврат – Авансовая оплата за товар без движения',
            ],
        },
        {
            date: '15.03.2023',
            time: '23:30',
            points: [
                'Добавил в расчет Логистика сторно',
            ],
        },
        {
            date: '08.03.2023',
            time: '20:30',
            points: [
                'Стилизовал кнопку выбора файла',
            ],
        },
        {
            date: '06.03.2023',
            time: '16:30',
            points: [
                'Добавил Возврат оплаты брака в расчеты',
                'Добавил Возврат потерянного товара в расчеты',
                'Добавил копирование при нажатии на УСН и К переводу без УСН',
                'Добавил изображение товара при вводе номенклатуры в форме Удержания и Платная приемка',
            ],
        },
        {
            date: '05.03.2023',
            time: '20:30',
            points: [
                'Добавил вычисление общей сумму при вводе рекламы',
                'Добавил ссылку на Финансовые отчеты и Платная приемка',
                'Добавил в расчет платную приемку',
                'Переименовал Рекламу и Общие штрафы в Прочие удержания',
                'Ограничил поле ввода цифрами',
            ],
        },
        {
            date: '05.03.2023',
            time: '01:00',
            points: [
                'Добавил в расчет Общий штраф',
            ],
        },
        {
            date: '04.03.2023',
            time: '19:30',
            points: [
                'Добавил в расчет Сторно продаж, Корректный возрат',
                'Добавил ссылку на товар при клике на изображение товара',
            ],
        },
        {
            date: '03.03.2023',
            time: '23:30',
            points: [
                'Добавил в расчет Хранение, Недоплата, Реклама',
                'Добавил стилизацию формы',
                'Добавил копирование номера при клике на Код, ШК, Баркод',
                'Добавил ссылку на история затрат рекламы',
                'Выбрать файл только формата xlsx',
                'Кнопка «Вычислить» не активна до выбора файла',
            ],
        },
        {
            date: '02.03.2023',
            time: '01:30',
            points: [
                'Добавил в Итого пункты «Реализовали товар» и «Перевод за продажи»',
                'Добавил в Итого к пунткам описание из отчетов',
                'Исправил высчитывание налога',
                'Добавил надпись «Без долей» в случае если доли не найдены',
            ],
        },
        {
            date: '01.03.2023',
            time: '00:30',
            points: [
                'Добавил превью изображение рядом с продуктом',
                'Добавил учет в расчетах сторно продаж',
                'Переименовал НДС в УСН',
                'Добавил сумму общей логистики',
            ],
        },
        {
            date: '28.02.2023',
            time: '17:30',
            points: [
                'Добавил ссылку на страницу товара при нажатии на Код',
                'Добавил ссылку на страницу товара в кабинете поставщика при нажатии на Артикул'
            ],
        },
        {
            date: '28.02.2023',
            time: '17:00',
            points: ['Добавлено история изменений'],
        },
    ];
</script>

<style lang="scss" scoped>
    .version-history {
        font-size: 12px;
        line-height: 1.2;
        background-color: #F5F5F5;
        padding: 16px;
        max-width: 500px;
        border-radius: 12px;

        &__time {
            margin-left: 8px;
        }

        &__points {
            margin-top: 8px;
        }

        &__point {
            color: rgba(black, 0.5);

            & + & {
                margin-top: 4px;
            }
        }

        & + & {
            margin-top: 12px;
        }
    }
</style>